In [81]:
#Importer vigtige pakker
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pandas_datareader as pdr
import pandas_datareader.data as web
import datetime
import pydst
dst = pydst.Dst(lang='en')

In [82]:
# a. loading data
dst.get_variables('NABP10') # command to se 'id'
dst.get_variables('NABP10').iloc[0]['values'] # command to se 'values' in 'TRANSAKT'

# Vi henter kun nominelle priser, da "Afl√∏nning af ansatte" ikke er angivet i faste priser 
gva10 = dst.get_data(table_id = 'NABP10', variables={'TRANSAKT':['B1GD','D1D'],'BRANCHE':['*'], 'PRISENHED':['V'], 'TID':['*']})
emp10 = dst.get_data(table_id = 'NABB10', variables={'SOCIO':['EMPH_DC','SALH_DC'],'BRANCHE':['*'], 'TID':['*']})

In [83]:
# b. define dictionaries to rename variables
columns_dict = {}
columns_dict['TRANSAKT'] = 'variable'
columns_dict['BRANCHE'] = 'industry'
columns_dict['PRISENHED'] = 'unit'
columns_dict['TID'] = 'year'
columns_dict['INDHOLD'] = 'value'
columns_dict['SOCIO'] = 'employment'

var_dict = {} # var is for variable
var_dict['B.1g Gross value added'] = 'GVA'
var_dict['D.1 Compensation of employees'] = 'ComEmp'
var_dict['Hours worked (1,000 hours)'] = 'Hours_TOT'
var_dict['Hours worked for employees (1,000 hours)'] = 'Hours_Emp'

unit_dict = {}
unit_dict['2010-prices, chained values'] = 'real'
unit_dict['Current prices'] = 'nominal'

# b. i
gva10.rename(columns=columns_dict,inplace=True)
emp10.rename(columns=columns_dict,inplace=True)

for key,value in var_dict.items():
    gva10.variable.replace(key,value, inplace=True)
    emp10.employment.replace(key,value, inplace=True)

for key,value in unit_dict.items():
    gva10.unit.replace(key,value, inplace=True)

# b. ii redefine value from 'str' to 'float'
emp10.value = emp10.value.astype('float')
gva10['value'] = gva10['value'].apply(pd.to_numeric, errors='coerce')

# skaber nye kolloner
emp10['Hours_TOT'] = emp10.value[emp10.employment == 'Hours_TOT']
emp10['Hours_Emp'] = emp10.value[emp10.employment == 'Hours_Emp']
gva10['GVA'] = gva10.value[gva10.variable == 'GVA']
gva10['ComEmp'] = gva10.value[gva10.variable == 'ComEmp']

gva10.tail()

,variable,industry,unit,year,value,GVA,ComEmp
1585,ComEmp,"R_S Arts, entertainment and other services",nominal,2014,38606,NaN,38606.0
1586,ComEmp,"R_S Arts, entertainment and other services",nominal,2015,38904,NaN,38904.0
1587,ComEmp,"R_S Arts, entertainment and other services",nominal,2016,40014,NaN,40014.0
1588,ComEmp,"R_S Arts, entertainment and other services",nominal,2017,41235,NaN,41235.0
1589,ComEmp,"R_S Arts, entertainment and other services",nominal,2018,42491,NaN,42491.0

In [84]:
# dropper 'employment'
emp10.drop(columns=['employment'], inplace = True)
emp10.drop(columns=['value'], inplace = True)
gva10.drop(columns=['variable'], inplace = True)
gva10.drop(columns=['value'], inplace = True)

In [94]:
 
#emp10 = emp10.dropna()
#gva10.head()
emp10.tail()
gva10.tail()

Empty DataFrame
Columns: [industry, unit, year, GVA, ComEmp]
Index: []

In [86]:
# c. merged data
merged = pd.merge(gva10,emp10,how='left',on=['year','industry'])
merged

,industry,unit,year,GVA,ComEmp,Hours_TOT,Hours_Emp
0,Total,nominal,1966,73555.0,NaN,4604383.0,NaN
1,Total,nominal,1966,73555.0,NaN,NaN,3637974.0
2,Total,nominal,1967,80538.0,NaN,4537166.0,NaN
3,Total,nominal,1967,80538.0,NaN,NaN,3605118.0
4,Total,nominal,1968,88782.0,NaN,4467413.0,NaN
5,Total,nominal,1968,88782.0,NaN,NaN,3568827.0
6,Total,nominal,1969,101289.0,NaN,4453350.0,NaN
7,Total,nominal,1969,101289.0,NaN,NaN,3585142.0
8,Total,nominal,1970,112399.0,NaN,4449231.0,NaN
9,Total,nominal,1970,112399.0,NaN,NaN,3608565.0
10,Total,nominal,1971,125050.0,NaN,4361538.0,NaN
11,Total,nominal,1971,125050.0,NaN,NaN,3547451.0
12,Total,nominal,1972,142119.0,NaN,4304325.0,NaN
13,Total,nominal,1972,142119.0,NaN,NaN,3512920.0
14,Total,nominal,1973,165043.0,NaN,4248746.0,NaN
15,Total,nominal,1973,165043.0,NaN,NaN,3475705.0
16,Total,nominal,1974,185957.0,NaN,4174298.0,NaN
17,Total,nominal,1974,185957.0,NaN,NaN,3419815.0
18,Total,nominal,1975,208105.0,NaN,3951117.0,NaN
19,Total,nominal,1975,208105.0,NaN,NaN,3220158.0
20,Total,nominal,1976,238885.0,NaN,4036100.0,NaN
21,Total,nominal,1976,238885.0,NaN,NaN,3315635.0
22,Total,nominal,1977,263241.0,NaN,3964626.0,NaN
23,Total,nominal,1977,263241.0,NaN,NaN,3257703.0
24,Total,nominal,1978,290632.0,NaN,3939905.0,NaN
25,Total,nominal,1978,290632.0,NaN,NaN,3252034.0
26,Total,nominal,1979,319747.0,NaN,3956147.0,NaN
27,Total,nominal,1979,319747.0,NaN,NaN,3301930.0
28,Total,nominal,1980,346702.0,NaN,3967630.0,NaN
29,Total,nominal,1980,346702.0,NaN,NaN,3343435.0
...,...,...,...,...,...,...,...
3150,"R_S Arts, entertainment and other services",nominal,2004,NaN,28700.0,NaN,154357.0
3151,"R_S Arts, entertainment and other services",nominal,2004,NaN,28700.0,184866.0,NaN
3152,"R_S Arts, entertainment and other services",nominal,2005,NaN,29858.0,NaN,160880.0
3153,"R_S Arts, entertainment and other services",nominal,2005,NaN,29858.0,189311.0,NaN
3154,"R_S Arts, entertainment and other services",nominal,2006,NaN,31732.0,NaN,166720.0
3155,"R_S Arts, entertainment and other services",nominal,2006,NaN,31732.0,193179.0,NaN
3156,"R_S Arts, entertainment and other services",nominal,2007,NaN,33127.0,NaN,167349.0
3157,"R_S Arts, entertainment and other services",nominal,2007,NaN,33127.0,192800.0,NaN
3158,"R_S Arts, entertainment and other services",nominal,2008,NaN,34762.0,NaN,169115.0
3159,"R_S Arts, entertainment and other services",nominal,2008,NaN,34762.0,195354.0,NaN
3160,"R_S Arts, entertainment and other services",nominal,2009,NaN,35895.0,NaN,166951.0
3161,"R_S Arts, entertainment and other services",nominal,2009,NaN,35895.0,194482.0,NaN
3162,"R_S Arts, entertainment and other services",nominal,2010,NaN,37092.0,NaN,169038.0
3163,"R_S Arts, entertainment and other services",nominal,2010,NaN,37092.0,196573.0,NaN
3164,"R_S Arts, entertainment and other services",nominal,2011,NaN,37972.0,NaN,171928.0
3165,"R_S Arts, entertainment and other services",nominal,2011,NaN,37972.0,199351.0,NaN
3166,"R_S Arts, entertainment and other services",nominal,2012,NaN,38492.0,NaN,168459.0
3167,"R_S Arts, entertainment and other services",nominal,2012,NaN,38492.0,195293.0,NaN
3168,"R_S Arts, entertainment and other services",nominal,2013,NaN,38362.0,NaN,167147.0
3169,"R_S Arts, entertainment and other services",nominal,2013,NaN,38362.0,194094.0,NaN
3170,"R_S Arts, entertainment and other services",nominal,2014,NaN,38606.0,NaN,167581.0
3171,"R_S Arts, entertainment and other services",nominal,2014,NaN,38606.0,194830.0,NaN
3172,"R_S Arts, entertainment and other services",nominal,2015,NaN,38904.0,NaN,164428.0
3173,"R_S Arts, entertainment and other services",nominal,2015,NaN,38904.0,192903.0,NaN
3174,"R_S Arts, entertainment and other services",nominal,2016,NaN,40014.0,NaN,165245.0
3175,"R_S Arts, entertainment and other services",nominal,2016,NaN,40014.0,193421.0,NaN
3176,"R_S Arts, entertainment and other services",nominal,2017,NaN,41235.0,NaN,165015.0
3177,"R_S Arts, entertainment and other services",nominal,2017,NaN,41235.0,193352.0,NaN
3178,"R_S Arts, entertainment and other services",nominal,2018,NaN,42491.0,NaN,160482.0
3179,"R_S Arts, entertainment and other services",nominal,2018,NaN,42491.0,189472.0,NaN